In [1]:
import pandas as pd

In [28]:
df1 = pd.read_csv("DataSets/Titanic-Dataset.csv")

In [27]:
df2 = pd.read_csv("DataSets/Employee.csv")

In [29]:
df1.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [30]:
df2.head(2)

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
0,Bachelors,2017,Bangalore,3,34.0,Male,No,0,0
1,Bachelors,2013,Pune,1,28.0,Female,No,3,1

In [31]:
pd.merge(df1, df2, on="Age")

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Education,JoiningYear,City,PaymentTier,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S,Bachelors,2016,Bangalore,3,Male,No,0,0
1,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S,Bachelors,2016,New Delhi,2,Female,No,0,1
2,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S,Bachelors,2013,Bangalore,3,Female,Yes,0,0
3,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S,Bachelors,2014,Pune,1,Female,No,0,1
4,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S,Bachelors,2015,New Delhi,3,Male,No,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
92455,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q,Bachelors,2014,Bangalore,3,Male,No,2,0
92456,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q,Bachelors,2015,Bangalore,3,Female,No,4,0
92457,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q,Bachelors,2018,Bangalore,3,Male,Yes,1,1
92458,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q,Bachelors,2018,Bangalore,3,Male,Yes,2,1
92459,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q,Bachelors,2015,Pune,3,Female,Yes,1,1

In [32]:
pd.merge(df1, df2, on="Age", how='inner')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Education,JoiningYear,City,PaymentTier,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S,Bachelors,2016,Bangalore,3,Male,No,0,0
1,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S,Bachelors,2016,New Delhi,2,Female,No,0,1
2,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S,Bachelors,2013,Bangalore,3,Female,Yes,0,0
3,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S,Bachelors,2014,Pune,1,Female,No,0,1
4,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S,Bachelors,2015,New Delhi,3,Male,No,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
92455,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q,Bachelors,2014,Bangalore,3,Male,No,2,0
92456,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q,Bachelors,2015,Bangalore,3,Female,No,4,0
92457,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q,Bachelors,2018,Bangalore,3,Male,Yes,1,1
92458,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q,Bachelors,2018,Bangalore,3,Male,Yes,2,1
92459,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q,Bachelors,2015,Pune,3,Female,Yes,1,1

In [36]:
pd.merge(df1, df2, on="Age", how='left')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Education,JoiningYear,City,PaymentTier,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S,Bachelors,2016.0,Bangalore,3.0,Male,No,0.0,0.0
1,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S,Bachelors,2016.0,New Delhi,2.0,Female,No,0.0,1.0
2,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S,Bachelors,2013.0,Bangalore,3.0,Female,Yes,0.0,0.0
3,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S,Bachelors,2014.0,Pune,1.0,Female,No,0.0,1.0
4,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S,Bachelors,2015.0,New Delhi,3.0,Male,No,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
92813,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q,Bachelors,2014.0,Bangalore,3.0,Male,No,2.0,0.0
92814,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q,Bachelors,2015.0,Bangalore,3.0,Female,No,4.0,0.0
92815,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q,Bachelors,2018.0,Bangalore,3.0,Male,Yes,1.0,1.0
92816,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q,Bachelors,2018.0,Bangalore,3.0,Male,Yes,2.0,1.0
92817,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q,Bachelors,2015.0,Pune,3.0,Female,Yes,1.0,1.0

In [37]:
pd.merge(df1, df2, on="Age", how='right')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Education,JoiningYear,City,PaymentTier,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
0,22,1,2,"Beesley, Mr. Lawrence",male,34.0,0,0,248698,13.0000,D56,S,Bachelors,2017,Bangalore,3,Male,No,0,0
1,99,1,2,"Doling, Mrs. John T (Ada Julia Bone)",female,34.0,0,1,231919,23.0000,NaN,S,Bachelors,2017,Bangalore,3,Male,No,0,0
2,100,0,2,"Kantor, Mr. Sinai",male,34.0,1,0,244367,26.0000,NaN,S,Bachelors,2017,Bangalore,3,Male,No,0,0
3,203,0,3,"Johanson, Mr. Jakob Alfred",male,34.0,0,0,3101264,6.4958,NaN,S,Bachelors,2017,Bangalore,3,Male,No,0,0
4,406,0,2,"Gale, Mr. Shadrach",male,34.0,1,0,28664,21.0000,NaN,S,Bachelors,2017,Bangalore,3,Male,No,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
92455,753,0,3,"Vande Velde, Mr. Johannes Joseph",male,33.0,0,0,345780,9.5000,NaN,S,Bachelors,2015,Bangalore,3,Male,Yes,4,0
92456,760,1,1,"Rothes, the Countess. of (Lucy Noel Martha Dye...",female,33.0,0,0,110152,86.5000,B77,S,Bachelors,2015,Bangalore,3,Male,Yes,4,0
92457,810,1,1,"Chambers, Mrs. Norman Campbell (Bertha Griggs)",female,33.0,1,0,113806,53.1000,E8,S,Bachelors,2015,Bangalore,3,Male,Yes,4,0
92458,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S,Bachelors,2015,Bangalore,3,Male,Yes,4,0
92459,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S,Bachelors,2015,Bangalore,3,Male,Yes,4,0

In [38]:
pd.merge(df1, df2, on="Age", how='outer')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Education,JoiningYear,City,PaymentTier,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
0,804,1,3,"Thomas, Master. Assad Alexander",male,0.42,0,1,2625,8.5167,NaN,C,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,756,1,2,"Hamalainen, Master. Viljo",male,0.67,1,1,250649,14.5000,NaN,S,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,470,1,3,"Baclini, Miss. Helene Barbara",female,0.75,2,1,2666,19.2583,NaN,C,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,645,1,3,"Baclini, Miss. Eugenie",female,0.75,2,1,2666,19.2583,NaN,C,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,79,1,2,"Caldwell, Master. Alden Gates",male,0.83,0,2,248738,29.0000,NaN,S,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
92813,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S,Bachelors,2017.0,Bangalore,3.0,Female,Yes,3.0,0.0
92814,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S,Bachelors,2013.0,Bangalore,3.0,Male,No,4.0,0.0
92815,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,Masters,2018.0,New Delhi,3.0,Female,Yes,2.0,1.0
92816,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,Bachelors,2017.0,Bangalore,3.0,Female,Yes,3.0,0.0
92817,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,Bachelors,2013.0,Bangalore,3.0,Male,No,4.0,0.0

In [42]:
pd.concat([df1, df2], axis=1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,...,Embarked,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
0,1.0,0.0,3.0,"Braund, Mr. Owen Harris",male,22.0,1.0,0.0,A/5 21171,7.2500,...,S,Bachelors,2017,Bangalore,3,34.0,Male,No,0,0
1,2.0,1.0,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,PC 17599,71.2833,...,C,Bachelors,2013,Pune,1,28.0,Female,No,3,1
2,3.0,1.0,3.0,"Heikkinen, Miss. Laina",female,26.0,0.0,0.0,STON/O2. 3101282,7.9250,...,S,Bachelors,2014,New Delhi,3,38.0,Female,No,2,0
3,4.0,1.0,1.0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0.0,113803,53.1000,...,S,Masters,2016,Bangalore,3,27.0,Male,No,5,1
4,5.0,0.0,3.0,"Allen, Mr. William Henry",male,35.0,0.0,0.0,373450,8.0500,...,S,Masters,2017,Pune,3,24.0,Male,Yes,2,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4648,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,Bachelors,2013,Bangalore,3,26.0,Female,No,4,0
4649,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,Masters,2013,Pune,2,37.0,Male,No,2,1
4650,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,Masters,2018,New Delhi,3,27.0,Male,No,5,1
4651,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,Bachelors,2012,Bangalore,3,30.0,Male,Yes,2,0
4652,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,Bachelors,2015,Bangalore,3,33.0,Male,Yes,4,0